SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( BNSF_ES44DC_7674
	Type ( Engine )
	WagonShape ( BNSF_ES44DC_7674.s )
	
	Size ( 3.13m 4.69732m 22.1324m )  
	comment( 420k lb is the maximum )
	Mass ( 188.3t )
	WheelRadius ( 42in/2 )
	InertiaTensor ( Box ( 3.13m 4.69732m 22.6324m ) )
	Coupling (
	    Type ( Automatic )
          Spring (
                  Stiffness ( 9.8e5N/m 1.76e6N/m )
                  Damping ( 1.78e6N/m/s 2.45e6N/m/s )
                  Break ( 2.45e7N 1.78e6N )
                  r0 ( 0cm 4cm )
                  )
          CouplingHasRigidConnection ( 1 )
                  Velocity ( 0.1m/s )
                 )
        Coupling (
       Type ( Automatic )
           Spring (
                   Stiffness ( 9.8e5N/m 1.76e6N/m )
                   Damping ( 1.78e6N/m/s 2.45e6N/m/s )
                   Break ( 2.45e6N 1.78e6N )
                   r0 ( 0cm 4cm )
                 )
           
                  Velocity ( -0.1m/s )
                )

	Adheasion ( 0.76 0.94 2.0 0 )
	DerailRailHeight ( 5cm )
	DerailRailForce ( 2.7*188.3t )
	DerailBufferForce ( 650kN )
	NumWheels (	12 )
	Friction (
		1814.6N/m/s	     -0.05		1.0mph	    15.31N/m/s	1.840
		5.1N/rad/s		1		-1rad/s		0		1
	)

	BrakeEquipmentType( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

	BrakeSystemType( "Air_single_pipe" )
	MaxBrakeForce( 115.0kN )

	EmergencyBrakeResMaxPressure( 110 )
	TripleValveRatio( 2.5 )
      EmergencyResVolumeMultiplier ( 1.461 )
	MaxReleaseRate( 0.49 )
	MaxApplicationRate( 0.93 )
	MaxAuxilaryChargingRate( 0.28 )
	EmergencyResCapacity( 8.7 )
	EmergencyResChargingRate( 0.24 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 64 )

	FreightAnim ( 7674parts.s 1 1 )

	IntakePoint ( 3.33 0.4 FuelDiesel )

Lights (	10
            Light	(
			comment( Sphere of Lights Bright)
			Type		( 1 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 3.0 7.0 )
					Transition ( 0 )
					Radius ( 300 )
					Angle ( 45.0 )
					)
				)
			)
		Light (			
                  Comment ( Sphere of lights Dim )
			Type		( 1 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 40FFFFCA )
					Position ( 0.0 3.3 7.0 )
					Transition ( 0 )
					Radius ( 100.0 )
					Angle ( 45.0 )
					)
				)
			)    
            Light	(
			comment( Head light Top dim )
			Type		( 0 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 3.49 10.390 )
					Transition ( 0 )
					Radius ( 0.8 )
					)
				)
			)
		Light	(
			comment( Head light Bottom dim )
			Type		( 0 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 3.29 10.391 )
					Transition ( 0 )
					Radius ( 0.8 )
					)
				)
			)

		Light	(
			comment( Right ditch light dim )
			Type		( 0 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	2
				State	(
					Duration ( 0.7 )
					LightColour ( FFFFFFCA )
					Position ( -0.83 1.9 10.93 )
					Transition ( 1 )
					Radius ( 1.0 )
					)
				State	(
					Duration ( 0.7 )
					LightColour ( 00000000 )
					Position ( -0.83 1.9 10.93 )
					Transition ( 1 )
					Radius ( 1.0 )
					)
				)
			)
		Light	(
			comment( Left ditch light dim )
			Type		( 0 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	2
				State	(
					Duration ( 0.7 )
					LightColour ( 00000000 )
					Position ( 0.83 1.9 10.93 )
					Transition ( 1 )
					Radius ( 1.0 )
					)
				State	(
					Duration ( 0.7 )
					LightColour ( FFFFFFCA )
					Position ( 0.83 1.9 10.93 )
					Transition ( 1 )
					Radius ( 1.0 )
					)
				)
			)
            Light	(
			comment( Head light Top bright )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 3.49 10.390 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		Light	(
			comment( Head light Bottom bright )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 3.29 10.391 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)		
		Light	(
			comment( Right ditch light )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( -0.83 1.9 10.93 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		Light	(
			comment( Left ditch light )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.83 1.9 10.93 )
					Transition ( 0 )
					Radius ( 1.0 )
					)
				)
			)
		)
	Sound ( "..//..//DASH9//SOUND//d9eng.sms" )
)

Engine ( BNSF_ES44DC_7674

	Wagon ( BNSF_ES44DC_7674 )
	Type ( Diesel )
	MaxPower ( 3100.4kW )
	MaxForce ( 880.8kN )
	MaxContinuousForce ( 738.5kN )
	comment( thats the usable one, full capacity is 5000gal )
	MaxDieselLevel( 5000gal ) 
	MaxVelocity ( 75mph )
	MaxCurrent ( 2300A )
	comment( the range of the load meter is 0 to 2300Amps )
	comment( air gauge graph: 40-140psi )
	WheelRadius ( 21in )
	comment( sanding system is switched off when faster than given velocity )
	Sanding ( 11mph )
	NumWheels ( 4 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

	AirBrakesAirCompressorPowerRating( 3.1 )
	AirBrakesMainMinResAirPressure( 14.7 )
	AirBrakesMainMaxAirPressure( 140 )
	AirBrakesMainResVolume( 10.2 )
	AirBrakesAirCompressorWattage( 12.6kw )
	AirBrakesCompressorRestartPressure( 134 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 1.44 )
	AirBrakesIsCompressorElectricOrMechanical( 0 )

	EngineBrakesControllerMinPressureReduction( 6 )
	TrainBrakesControllerMinPressureReduction( 6 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesProportionalBrakeLag( 0.45 )
	EngineBrakesControllerMaxApplicationRate( 7 )
	TrainBrakesControllerMaxApplicationRate( 3 )
	EngineBrakesControllerMaxReleaseRate( 10 )
	TrainBrakesControllerMaxReleaseRate( 2.5 )
	EngineBrakesControllerEmergencyApplicationRate( 8 )
	TrainBrakesControllerEmergencyApplicationRate( 7 )
	EngineBrakesControllerMinSystemPressure( 15 )
	TrainBrakesControllerMinSystemPressure( 15 )
	EngineBrakesControllerMaxSystemPressure( 90 )
	TrainBrakesControllerMaxSystemPressure( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty( 60 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
	EngineBrakesControllerFullServicePressureDrop( 26 )
	TrainBrakesControllerFullServicePressureDrop( 26 )

	DynamicBrakesMinUsableSpeed( 5.0 )
	DynamicBrakesMaximumEffectiveSpeed( 27 )
	DynamicBrakesMaximumForce( 520.4kN )
	DynamicBrakesResistorCurrentLimit ( 1200 )
	DynamicBrakesCutInSpeed( 8 )
	DynamicBrakesMaxAirBrakePressure ( 50 )
	DynamicBrakesFadingSpeed( 7 )
	DynamicBrakesDelayTimeBeforeEngaging ( 7 )
	DynamicBrakesMaximumSpeedForFadeOut ( 620 )
	DynamicBrakesEffectAtMaximumFadeOut( 0 )
	DynamicBrakesHigherSpeedCurveExponent( 12 )
	DynamicBrakesLowerSpeedCurveExponent( 1.6 )
	DynamicBrakesNumberOfControllerNotches( 1 )
      DynamicBrakeHasAutoBailOff ( 1 )

	BrakesEngineBrakeType( "Air_single_pipe"  )
	BrakesTrainBrakeType( "Air_single_pipe" )
      BrakesEngineControllers( "Independent, Train, Dynamic" )

	EngineBrakesControllerDirectControlExponent( 1 )
	
	CabView ( dash9.cvf )
      HeadOut ( 1.72 3.7 8.4 )
	MaxDieselLevel ( 5000gal )
	DieselUsedPerHourAtMaxPower ( 155gal )
	DieselUsedPerHourAtIdle ( 3.6gal )

	DieselSmokeEffectInitialMagnitude( 2.0 )
	DieselSmokeEffectMaxMagnitude( 3.2 )
	DieselSmokeEffectInitialSmokeRate( 0.4 )
	DieselSmokeEffectMaxSmokeRate( 12 )

	DieselEngineIdleRPM( 315 )
	DieselEngineMaxRPM( 1050 )
	DieselEngineSpeedOfMaxTractiveEffort( 11.5mph )
	DieselEngineMaxRPMChangeRate( 18 )

	DoesHornTriggerBell( 1 )
	
	comment( infinate sanding time )
	MaxSandingTime( -1 )

	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 0 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)

	VigilanceMonitor(
		MonitoringDeviceMonitorTimeLimit( 25 )
		MonitoringDeviceAlarmTimeLimit( 17 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)
		
	OverspeedMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 0 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 78 )
		MonitoringDeviceResetLevel( 0.1 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceAlarmTimeBeforeOverSpeed( 5 )
		MonitoringDeviceDoesSuppressionReset( 0 )
		MonitoringDeviceTriggerOnOverspeed( 76 )
		MonitoringDeviceResetOnZeroSpeed( 1 )
		MonitoringDeviceResetOnResetButton( 0 )
		)
 
       EngineControllers (
            Throttle ( 0 1 0.125 0 
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.0250 0 
                NumNotches ( 1
                    Notch ( 0       1 Dummy )                    
                )
            )
            Brake_Train ( 0 1 0.0125 0.75 
                NumNotches ( 5
                    Notch ( 0    0 TrainBrakesControllerReleaseStart )
                    Notch ( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                    Notch ( 0.85 0 TrainBrakesControllerSuppressionStart )
                    Notch ( 0.9  0 TrainBrakesControllerContinuousServiceStart )
                    Notch ( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
            Brake_Dynamic ( 0 1 0.0125 0 
                NumNotches ( 3
                    Notch ( 0       0 Dummy )
                    Notch ( 0.0125  1 Dummy )
                    Notch ( 0.0126  1 Dummy )
                 )
            )

            Combined_Control( 0 1 0.5 0.5 throttle dynamic )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
        )

	comment( fuel_level )
	EngineVariables ( 5000 )
	Sound ( "..//..//DASH9//SOUND//d9cab.sms" )
	Name ( "BNSF ES44DC 7674" )
	Description (
	"The GE-ES44DC, a modern diesel-electric locomotive, most effective "+
	"pulling loads over long stretches at moderate speeds.\n\n"+
	"Locomotive type: Diesel-Electric \n\n"+
      "Power: 4,445 hp\n\n"+
	"Max. speed: 75 mph (119 km/h)\n\n"+
	"Power source: Diesel engine GEVO12 12 cylinder \n\n"+
	"Max. starting tractive effort: 198,000 lb \n\n"+
	"Max. continuous tractive effort: 166,000 lb \n\n"+
	"Wheel configuration: Twelve 42-inch (16.5 cm) diameter in C-C configuration (two sets of three "+
	"driven axles)\n\n"+
	"Weight: 415,000 pounds"	
	)
	
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key to move the Reverser to Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+  
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+  
	"To apply the dynamic brakes\n"+
	"1.	Press the A key to move the throttle to the Idle position.\n"+
	"2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position.  After allowing a few seconds for braking circuit setup, press the . [PERIOD] key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
	"To release the dynamic brakes\n"+
	"1.	Press the D key to move the throttle towards Idle.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To bail off the train brakes on the locomotive\n"+
	"1. Press the / (FORWARD SLASH) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To apply the locomotive brake\n"+
	"1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
	"To release the locomotive brake\n"+
	"1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"4.	Release the brakes.\n"+
	"5.	Slowly advance the throttle lever (D key).\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
	)
)
